building-a-rails-api/asana-builder-api/app/models/sequence.rb

SELECT "postures".* FROM "postures" WHERE "postures"."sequence_id" = ?  [["sequence_id", 5]]
---
    def duration
        self.postures.sum do |posture|