building-a-rails-api/asana-builder-api/app/controllers/asanas_controller.rb

    def index
        asanas = Asana.all
---
SELECT "asanas".* FROM "asanas"

    def update
        asana = Asana.find(params[:id])
        binding.pry
        if asana.update(name: params[:asana][:name])
---
SELECT "asanas".* FROM "asanas" WHERE "asanas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "asanas" SET "name" = ?, "updated_at" = ? WHERE "asanas"."id" = ?  [["name", "a new asana name"], ["updated_at", "2020-04-08 00:59:13.532359"], ["id", 466]]