building-a-rails-api/asana-builder-api/app/controllers/postures_controller.rb

    def create
        @sequence = Sequence.find_by(id: params[:posture][:sequence_id])
        if user_authorized?
            @posture = Posture.new(posture_params)
            if @posture.save
---
SELECT "sequences".* FROM "sequences" WHERE "sequences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "postures" ("asana_id", "sequence_id", "duration", "variation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["asana_id", 193], ["sequence_id", 9], ["duration", 5], ["variation", ""], ["created_at", "2020-03-03 15:55:08.141686"], ["updated_at", "2020-03-03 15:55:08.141686"]]

    def get_sequence
        @sequence ||= Sequence.find_by(id: params[:sequence_id])
---
SELECT "sequences".* FROM "sequences" WHERE "sequences"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]