building-a-rails-api/asana-builder-api/app/controllers/sequences_controller.rb

    def create
        @sequence = current_user.sequences.build(sequence_params)
        if @sequence.save
---
INSERT INTO "sequences" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "new sequence"], ["created_at", "2020-03-02 22:17:31.323326"], ["updated_at", "2020-03-02 22:17:31.323326"], ["user_id", 2]]