building-a-rails-api/asana-builder-api/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."github_uid" = ? LIMIT ?  [["github_uid", nil], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at", "github_uid") VALUES (?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ally"], ["LIMIT", 1]]
---
    def create
        # if a user logged in with omniauth (how can we tell?)
        if request.env["omniauth.auth"]
            #then find or create them in the db by uid
            @user = User.find_by(github_uid: request.env["omniauth.auth"]["uid"])
            if @user.nil?
                @user = User.create(username: request.env["omniauth.auth"]["info"]["nickname"], github_uid: request.env["omniauth.auth"]["uid"], password: "github")
            end
            log_in(@user)
            redirect_to sequences_path
        else
            # locally authenticate the user - verify they exist in the db by username
            # and that their password matches what is in the db
            @user = User.find_by(username: params[:username])