building-a-rails-api/asana-builder-api/app/views/sequences/index.html.erb

SELECT "postures".* FROM "postures" WHERE "postures"."sequence_id" = ?  [["sequence_id", 1]]
SELECT COUNT(*) FROM "postures" WHERE "postures"."sequence_id" = ?  [["sequence_id", 1]]
---
    <h3><%= link_to sequence.name, sequence_postures_path(sequence) %></h3>
    <p><%= sequence.postures.count %> postures</p>