building-a-rails-api/asana-builder-api/app/views/postures/index.html.erb

SELECT "postures".* FROM "postures" WHERE "postures"."sequence_id" = ?  [["sequence_id", 1]]
---
<div class="postures">
    <% @sequence.postures.each.with_index(1) do |posture, index| %>