building-a-rails-api/asana-builder-api/app/views/postures/new.html.erb

    <%= f.label :asana %>
    <div><%= f.collection_select :asana_id, Asana.all, :id, :name, prompt: true %></div>
---
SELECT "asanas".* FROM "asanas"